HarryZeng/STM32F31_W8SET_CI_AND_MARK_IO_PWM/MDK-ARM/main.c
    nvic_init_structure.NVIC_IRQChannel = TIM1_BRK_UP_TRG_COM_IRQn;                //使能TIM1中断通道  
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;                //使能TIM1中断  
    nvic_init_structure.NVIC_IRQChannelPriority = 8;                //优先级为0  
		
    NVIC_Init(&nvic_init_structure); 

		/* Time ??????*/
		timer_init_structure.TIM_Prescaler = 5;  //48/6=8 ,8M->0.125us
		timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;  /* Time ????????????*/
		timer_init_structure.TIM_Period = 640;   // 960->120us  
		timer_init_structure.TIM_RepetitionCounter = 0;

		TIM_TimeBaseInit(TIM1, &timer_init_structure);
		/* TIM1 ?????*/
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_Update);							//选择TIM1的timer为触发源  
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC1Ref);							//选择TIM1的timer为触发源  
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC2Ref);							//选择TIM1的timer为触发源  
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC3Ref);							//选择TIM1的timer为触发源  
		//TIM_SelectSlaveMode(TIM1, TIM_SlaveMode_Gated);//触发模式只启动，门控制启停都可以控制
		TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);                      //使能TIM1中断
		TIM_ClearITPendingBit(TIM1, TIM_IT_Update);     //清除update事件中断标志

		TIM_Cmd(TIM1, ENABLE);

		/* TIM1 ????? */
}


void TIM1_PWM_Config(void)
{
	  TIM_TimeBaseInitTypeDef timer_init_structure;  
		TIM_OCInitTypeDef timer_OCinit_structure; 
    NVIC_InitTypeDef nvic_init_structure;  
  	GPIO_InitTypeDef gpio_init_structure;
	
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 , ENABLE);	
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA , ENABLE);	
	
    gpio_init_structure.GPIO_Pin = PWMX_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_AF;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    //??  
    GPIO_Init(PWMX_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = PWMY_Pin;  
		GPIO_Init(PWMY_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = PWMZ_Pin;  
		GPIO_Init(PWMZ_GPIO_Port, &gpio_init_structure);
	
		GPIO_PinAFConfig(GPIOA,GPIO_PinSource8,GPIO_AF_2);
		GPIO_PinAFConfig(GPIOA,GPIO_PinSource9,GPIO_AF_2);
		GPIO_PinAFConfig(GPIOA,GPIO_PinSource10,GPIO_AF_2);
	
    nvic_init_structure.NVIC_IRQChannel = TIM1_BRK_UP_TRG_COM_IRQn;                //使能TIM1中断通道  
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;                //使能TIM1中断  
    nvic_init_structure.NVIC_IRQChannelPriority = 2;                //优先级为0  
		
    NVIC_Init(&nvic_init_structure); 


		/* TIM1 ??? ---------------------------------------------------
		 TIM1 ????(TIM1CLK) ??? APB2 ?? (PCLK2)    
			=> TIM1CLK = PCLK2 = SystemCoreClock
		 TIM1CLK = SystemCoreClock, Prescaler = 0, TIM1 counter clock = SystemCoreClock
		 SystemCoreClock ?48 MHz 
		 
		 ??????? 4 ?PWM ???17.57 KHz:
			 - TIM1_Period = (SystemCoreClock / 17570) - 1
		 ??1??????? 50%
		 ??2??????? 37.5%
		 ??3??????? 25%
		 ??4??????? 12.5%
		 ????????????:
			 - ChannelxPulse = DutyCycle * (TIM1_Period - 1) / 100
		*/  
			/*???????,???????????????*/
		//TimerPeriod = (SystemCoreClock / 17570 ) - 1;
		//TimerPeriod = (SystemCoreClock / DEF_PWMFRE ) - 1;
		//TimerPeriod = (SystemCoreClock / DEF_PWMFRE);
		/* TIM1 ???? */


		/* Time ??????*/
		timer_init_structure.TIM_Prescaler = 5;  //48/6=8 ,8M->0.125us
		timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;  /* Time ????????????*/
		timer_init_structure.TIM_Period = 960;   // 960->120us  
		timer_init_structure.TIM_RepetitionCounter = 0;

		TIM_TimeBaseInit(TIM1, &timer_init_structure);

		/* ??1,2,3,4?PWM ???? */
		timer_OCinit_structure.TIM_OCMode = TIM_OCMode_PWM1;
		timer_OCinit_structure.TIM_OutputState = TIM_OutputState_Enable ;//TIM_OutputState_Enable; //PWM?????
		timer_OCinit_structure.TIM_OutputNState = TIM_OutputNState_Disable ;//TIM_OutputNState_Enable; //??PWM?????
		timer_OCinit_structure.TIM_OCPolarity = TIM_OCPolarity_High;  //PWM 1?????
		timer_OCinit_structure.TIM_OCNPolarity = TIM_OCNPolarity_Low; //PWM?? 0?????
		timer_OCinit_structure.TIM_OCIdleState = TIM_OCIdleState_Set;
		timer_OCinit_structure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

		timer_OCinit_structure.TIM_Pulse = PWMx_HIGH; //?????
		TIM_OC1Init(TIM1, &timer_OCinit_structure);//????1??
		TIM_OC1PreloadConfig(TIM1,TIM_OCPreload_Disable);

		timer_OCinit_structure.TIM_Pulse = PWMy_HIGH; //?????
		TIM_OC2Init(TIM1, &timer_OCinit_structure);//????1??
		TIM_OC2PreloadConfig(TIM1,TIM_OCPreload_Disable);

		timer_OCinit_structure.TIM_Pulse = PWMz_HIGH; //?????
		TIM_OC3Init(TIM1, &timer_OCinit_structure);//????1??
		TIM_OC3PreloadConfig(TIM1,TIM_OCPreload_Disable);

		TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);                      //使能TIM1中断
		TIM_ITConfig(TIM1, TIM_IT_CC1, ENABLE);                      //使能TIM1中断
		TIM_ITConfig(TIM1, TIM_IT_CC2, ENABLE);                      //使能TIM1中断
		TIM_ITConfig(TIM1, TIM_IT_CC3, ENABLE);                      //使能TIM1中断

		TIM_ARRPreloadConfig(TIM1,DISABLE);

		/* TIM1 ?????*/
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_Update);							//选择TIM1的timer为触发源  
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC1Ref);							//选择TIM1的timer为触发源  
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC2Ref);							//选择TIM1的timer为触发源  
		//TIM_SelectOutputTrigger(TIM1, TIM_TRGOSource_OC3Ref);							//选择TIM1的timer为触发源  
		//TIM_SelectSlaveMode(TIM1, TIM_SlaveMode_Gated);//触发模式只启动，门控制启停都可以控制
		TIM_ClearITPendingBit(TIM1, TIM_IT_Update);     //清除update事件中断标志
		TIM_ClearITPendingBit(TIM1, TIM_IT_CC1);     //清除update事件中断标志
		TIM_ClearITPendingBit(TIM1, TIM_IT_CC2);     //清除update事件中断标志
		TIM_ClearITPendingBit(TIM1, TIM_IT_CC3);     //清除update事件中断标志
		//TIM_SelectMasterSlaveMode(TIM1, TIM_MasterSlaveMode_Enable);//主从模式MSM  
		TIM_CtrlPWMOutputs(TIM1, ENABLE);
		//TIM_SelectOnePulseMode(TIM1,TIM_OPMode_Single);

		TIM_Cmd(TIM1, ENABLE);

		/* TIM1 ????? */
	
}

void TIM2_PWM_Config(void)
{
    TIM_TimeBaseInitTypeDef timer_init_structure;  
		TIM_OCInitTypeDef timer_OCinit_structure; 
    NVIC_InitTypeDef nvic_init_structure;  
  	GPIO_InitTypeDef gpio_init_structure;	

		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA , ENABLE);	
	
		nvic_init_structure.NVIC_IRQChannel = TIM2_IRQn;                //使能TIM2中断通道  
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;                //使能TIM2中断  
    nvic_init_structure.NVIC_IRQChannelPriority = 6;                //优先级为0  
		
    NVIC_Init(&nvic_init_structure); 
		
    gpio_init_structure.GPIO_Pin = PWM1_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_AF;                   //????(??)??  
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              //Fast speed  
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    //??  
    GPIO_Init(PWM1_GPIO_Port, &gpio_init_structure);

		GPIO_PinAFConfig(GPIOA,GPIO_PinSource2,GPIO_AF_2);
		/*TIM2*/
    TIM_DeInit(TIM2);                                               //复位TIM2  
    TIM_TimeBaseStructInit(&timer_init_structure);                  //初始化TIM结构体  
  
    timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;      //向上计数模式  
    timer_init_structure.TIM_Period = 960;                          //每43 uS触发一次中断,??ADC  
    timer_init_structure.TIM_Prescaler = 5;                      //计数时钟分频,f=1M,systick=1 uS  
    timer_init_structure.TIM_RepetitionCounter = 0;              //发生0+1的update事件产生中断 
		
