HarryZeng/STM32F31_W8SET_CI_AND_MARK_IO_PWM/MDK-ARM/main.c
    TIM_TimeBaseInit(TIM2, &timer_init_structure);  
  
		timer_OCinit_structure.TIM_OCMode = TIM_OCMode_PWM1;
		timer_OCinit_structure.TIM_OutputState = TIM_OutputState_Enable;
		timer_OCinit_structure.TIM_Pulse = PWM1_HIGH;
		timer_OCinit_structure.TIM_OCPolarity = TIM_OCPolarity_High;

		TIM_OC3Init(TIM2,&timer_OCinit_structure);
		TIM_OC3PreloadConfig(TIM2,TIM_OCPreload_Enable);
		TIM_ARRPreloadConfig(TIM2,ENABLE);
		
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);                      //使能TIM2中断
		TIM_SelectOutputTrigger(TIM2, TIM_TRGOSource_Update);           //选择TIM1的update为触发源  
		//TIM_SelectInputTrigger(TIM2, TIM_TS_ITR0);
		//TIM_SelectSlaveMode(TIM2, TIM_SlaveMode_Gated);//触发模式只启动，门控制启停都可以控制
		//TIM_SelectMasterSlaveMode(TIM2, TIM_MasterSlaveMode_Enable);//主从模式MSM

		TIM_Cmd(TIM2, ENABLE);
}

void TIM3_Config(void)
{
    TIM_TimeBaseInitTypeDef timer_init_structure;  
    NVIC_InitTypeDef nvic_init_structure;  
	
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);            //??TIM2??  //??GPIO??  
	
		nvic_init_structure.NVIC_IRQChannel = TIM3_IRQn;                //使能TIM3中断通道  
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;                //使能TIM3中断  
    nvic_init_structure.NVIC_IRQChannelPriority = 4;                //优先级为4
		
    NVIC_Init(&nvic_init_structure); 

		/*TIM3*/
		TIM_DeInit(TIM3);                                               //复位TIM3
    TIM_TimeBaseStructInit(&timer_init_structure);                  //初始化TIM结构体  
  
    timer_init_structure.TIM_ClockDivision = TIM_CKD_DIV1;          //系统时钟,不分频,24M  
    timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;      //向上计数模式  
    timer_init_structure.TIM_Period = 1222;                          //每1000 uS触发一次中断,??ADC  
    timer_init_structure.TIM_Prescaler = 47;                      //计数时钟分频,f=1M,systick=1 uS  
    timer_init_structure.TIM_RepetitionCounter = 0x00;              //发生0+1的update事件产生中断 
		
    TIM_TimeBaseInit(TIM3, &timer_init_structure);  
		TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);                      //使能TIM3中断
    TIM_Cmd(TIM3, ENABLE);                                          //使能TIM3
	
}
    
/****************************??????****************************/  

void TIM2_IRQHandler()  
{  
    if(TIM_GetITStatus(TIM2, TIM_FLAG_Update))            //判断发生update事件中断  
    {
				//_Gpio_7_set;
        TIM_ClearFlag(TIM2, TIM_FLAG_Update);     //清除update事件中断标志
    }  
}  
int16_t captureX=0,captureY=0,captureZ=0;
void TIM1_BRK_UP_TRG_COM_IRQHandler()  
{  
    if(TIM_GetITStatus(TIM1, TIM_FLAG_Update)==SET)            //判断发生update事件中断  
    {
			//_Gpio_7_set;
      TIM_ClearFlag(TIM1, TIM_FLAG_Update);     //清除update事件中断标志
    }
		if(TIM_GetITStatus(TIM1, TIM_IT_CC1) != RESET)
		{
			TIM_ClearFlag(TIM1, TIM_IT_CC1 ); //清除update事件中断标志		
		}
		if(TIM_GetITStatus(TIM1, TIM_IT_CC2) != RESET)
		{
			TIM_ClearFlag(TIM1, TIM_FLAG_CC2);     //清除update事件中断标志
		}
		if(TIM_GetITStatus(TIM1, TIM_IT_CC3) != RESET)
		{
			TIM_ClearFlag(TIM1, TIM_FLAG_CC3);     //清除update事件中断标志
		}
} 



extern uint32_t   ShortCircuitLastTime;
void TIM3_IRQHandler()
{
	  if(TIM_GetITStatus(TIM3, TIM_IT_Update))            //判断发生update事件中断  
    { 
//			scan_tick++;
//			_Gpio_7_set;
//			if(scan_tick>=10)  /*10*1.22=12.2ms*/
//			{
//				scan_tick = 0;
//				scan_key();
//			}
			TIM_ClearITPendingBit(TIM3, TIM_IT_Update);     //清除update事件中断标志
		}
}


int16_t  RunTime = 0; 

extern uint8_t SelfGetADCWell;
extern uint8_t FB_Flag;
uint8_t ADCIndex=0;
uint8_t DMAIndex=0;
int16_t selfADCValue[12];
uint8_t ADC_Conversion_Flag=0;
void DMA1_Channel1_IRQHandler()  
{  
    if(DMA_GetITStatus(DMA_IT_TC))                      //判断DMA传输完成中断  
    {   
			selfADCValue[ADCIndex++] = 4095 - adc_dma_tab[0];
			ADC_Conversion_Flag=1;
//			if(ADCIndex>3)   //X,Y,Z三组，四个，==12个    /*需要采集完4组才计算？？？？，要480us*/
//			{
//				ADCIndex = 0;
////				if(EnterSelfFlag&&(DMAIndex==0))//自学习模式
////				{
////						DMAIndex=1;
////						SelfGetADCWell=1;
////				}
////				else													//正常工作模式
////				{
//					sample_finish = 1;
////					//RunTime = TIM_GetCounter(TIM14);
////				}
//			}
			DMA_ClearITPendingBit(DMA_IT_TC);                   //清楚DMA中断标志位  
    }  
}  

void TIM14_IRQHandler()
{
	  if(TIM_GetITStatus(TIM14, TIM_IT_Update))            //判断发生update事件中断  
    { 
			scan_tick++;
			_Gpio_7_set;
			if(scan_tick>=10)  /*10*1.22=12.2ms*/
			{
				scan_tick = 0;
				scan_key();
			}
			TIM_ClearITPendingBit(TIM14, TIM_IT_Update);     //清除update事件中断标志
		}
}
/***********************/
void TIM14_Config(void)
{
    TIM_TimeBaseInitTypeDef timer_init_structure;  
		NVIC_InitTypeDef nvic_init_structure;  	
	
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM14, ENABLE);
		/*TIM14*/
		TIM_DeInit(TIM14);                                               //复位TIM14

		nvic_init_structure.NVIC_IRQChannel = TIM14_IRQn;                //使能TIM14中断通道  
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;                //使能TIM14中断  
    nvic_init_structure.NVIC_IRQChannelPriority = 1;                //优先级为4
    NVIC_Init(&nvic_init_structure); 	

    TIM_TimeBaseStructInit(&timer_init_structure);                  //初始化TIM结构体  
  
    timer_init_structure.TIM_ClockDivision = TIM_CKD_DIV1;          //系统时钟,不分频,24M  
    timer_init_structure.TIM_CounterMode = TIM_CounterMode_Up;      //向上计数模式  
    timer_init_structure.TIM_Period = 1000;                          //每300 uS触发一次中断,??ADC  
    timer_init_structure.TIM_Prescaler = 47;                      //计数时钟分频,f=1M,systick=1 uS  
    timer_init_structure.TIM_RepetitionCounter = 0x00;              //发生0+1的update事件产生中断 
		
    TIM_TimeBaseInit(TIM14, &timer_init_structure);  
		TIM_ITConfig(TIM14, TIM_IT_Update, ENABLE);                      //使能TIM14中断
    TIM_Cmd(TIM14, ENABLE);                                          //使能TIM14
}


void GPIO_INIT(void)
{
	
	    GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA|RCC_AHBPeriph_GPIOB|RCC_AHBPeriph_GPIOF, ENABLE);  
  
